project.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-15 Fri 08:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Projektkurs Volkswirtschaftslehre: let the computer do the calculations</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" href="./icons/pc.webp">
<link rel="stylesheet" href="./css/stylesheet.css">

</head>
<body>
<div id="preamble" class="status">
<div id="preamble" class="status">
  <div class="banner">
<ul class="menu">
 <li class="inmenu"> <a class="lmenu" id="subtitle" href="./index.html">Home</a></li>
 <li class="inmenu"> <a class="lmenu" id="subtitle" href="./research.html">Research</a></li>
 <li class="inmenu">   <a class="lmenu" id="subtitle" href="./misc.html">Misc</a>  </li>
 <li class="dropdown"> <a class="lmenu" id="subtitle" href="./teaching.html">Teaching</a>
   <div class="dropdown-content">
      <a href="./micromsc.html">Microeconomics (MSc)</a>
      <a href="./advmicro.html">Advanced Microeconomics (MER)</a>
      <a href="./infostrat.html">Information and Strategy</a>
      <a href="./project.html">Project (BSc)</a>
      <a href="./infohealth.html">Imperfect Information in Health Care Markets</a>
      <a href="./thesis_guidelines.html">Thesis Supervision</a>
    </div>
 </li>
</ul>
   <span> </span>

    </div>
  </div>
  
<hr style="clear:both;margin-bottom: 0.4cm; margin-top: -1cm"/>
</div>
<div id="content" class="content">
<h1 class="title">Projektkurs Volkswirtschaftslehre: let the computer do the calculations</h1>
<div id="outline-container-org46d4b2a" class="outline-2">
<h2 id="org46d4b2a">News</h2>
<div class="outline-text-2" id="text-org46d4b2a">
<ul class="org-ul">
<li>The project presentations (around 15 minutes per group) take place on July 18. The deadline for your final submission is August 11. The final submission consists of (i) a jupyter notebook with your project, (ii) a jupyter notebook with solutions to the exercises listed below and (iii) your cheat sheet as a pdf document. Please upload all three files to sciebo or another cloud storage provider (like Dropbox, GoogleDrive etc.) and send me a link to the folder via email. The exercises for which solutions have to be handed in are the following:
<ul class="org-ul">
<li>Week 4: E1, E3</li>
<li>Week 5: E1, E2, E3</li>
<li>Week 6: E2</li>
<li>Week 7: E1, E3</li>
<li>Week 8: E1, E2</li>
</ul></li>
</ul>


<ul class="org-ul">
<li>We will talk about "week 1" of jpfnb on May 2 and have a make-up zoom-meeting in which we answer questions about the material of "week 2" and the corresponding exercises on May 8 17:30 (Meeting ID: 988 9247 0093 Password: 843160). Solutions to some of the exercises of the first two weeks are on this website below.</li>
<li>Due to health issues, there is no meeting on April 25. I will inform you as soon as I am better about a make up meeting.</li>
<li>There is no meeting on April 11 as I am attending an international conference. We will have our first meeting on April 18.</li>
</ul>

<ul class="org-ul">
<li>In week 1, we talk a bit about the course and try to install julia on your computer. <b>Please note that you need to bring a notebook to class every week in order to be able to work.</b> (It does not matter whether your operating system is Windows, MacOS, Linux or FreeBSD. However, tablets or phones with mobile operating systems like Android and iOS will not work.)</li>
<li>A sample <a href="https://github.com/schottmueller/projectJulia/files/11769248/projects.pdf">project description</a> is available now.</li>
</ul>
</div>
</div>
<div id="outline-container-org56b7591" class="outline-2">
<h2 id="org56b7591">Description</h2>
<div class="outline-text-2" id="text-org56b7591">
<p>
Modern economics relies heavily on mathematical models. Solving these models by hand is usually burdensome and often outright infeasible. In these cases, computers can be used to analyse and solve economic models numerically. This project course gives an introduction to solving models numerically with the help of the computer. It is suitable for students with no (or little) prior knowledge of numerical analysis and/or programming.
</p>

<p>
The first part of the course gives an introduction to programming using the programming language "julia". The second part shows how to use julia to do numerical analysis (solving equations, maximizing functions, creating plots etc.). In the third part, students undertake a small project in which they use the skills acquired in the first two parts.
</p>

<p>
Students are asked to watch video tutorials (part 1) or "notebooks" (part 2) at home. In class questions on these are answered and students work on small exercises.
</p>

<p>
The skills acquired in this course will be particularly useful for writing term papers or a thesis but are also valued on the job market.
</p>

<p>
<b>Time and place:</b> Thursdays 10:00-11:30, Mensa building, 118/03/3.03
</p>

<p>
<b>Grading:</b> The grade is based on three elements: First, a "julia cheat sheet" which is a document in which you write down the julia commands and functions you have learned together with a brief description of what they do or an example. Second, a jupyter notebook with solutions to the exercises. You will work on this during class. Third, your project which will be presented in class and handed in as a jupyter notebook.
</p>
</div>
</div>
<div id="outline-container-org702bbfe" class="outline-2">
<h2 id="org702bbfe">Preliminary plan</h2>
<div class="outline-text-2" id="text-org702bbfe">
<p>
The following plan might be adapted over the course of the semester. I use the following abbreviations:
</p>
<ul class="org-ul">
<li>jpfnb:  <a href="https://juliaacademy.com/p/julia-programming-for-nervous-beginners">"Julia Programming for Nervous Beginners"</a></li>
<li><p>
jfmt: <a href="https://github.com/schottmueller/juliaForMicroTheory">"Julia for micro theory"</a>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Week</th>
<th scope="col" class="org-left">content</th>
<th scope="col" class="org-left">to do before next week's class</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">info, installing julia, jupyter notebooks</td>
<td class="org-left">"week 1" of jpfnb</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">strings, data containers</td>
<td class="org-left">"week 2" of jpfnb</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">numbers, functions</td>
<td class="org-left">"week 3" of jpfnb</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">loops, if/else</td>
<td class="org-left">"week 4" of jpfnb, notebooks 1-2 jfmt</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">plotting and maximizing functions, interact.jl</td>
<td class="org-left">notebooks 3,4,6,7 jfmt</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">equation solving, multivariate maximization</td>
<td class="org-left">notebook 8 jfmt, notebooks <a href="https://github.com/schottmueller/juliaForMicroTheory/blob/master/dataDiscovery.org">data</a> (skip sections 3.3, 4.3,4.5-4.7)</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">data and statistics</td>
<td class="org-left">notebooks on  <a href="https://github.com/schottmueller/juliaForMicroTheory/blob/master/hypothesisTesting.org">hypothesis testing</a> (only sections 1 and 2) and on <a href="https://github.com/schottmueller/juliaForMicroTheory/blob/master/regression.org">regressions</a></td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">OLS</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">project work</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">project work</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">project presentations</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
<div id="outline-container-orge166804" class="outline-2">
<h2 id="orge166804">Material and links</h2>
<div class="outline-text-2" id="text-orge166804">
</div>
<div id="outline-container-orga225ef0" class="outline-3">
<h3 id="orga225ef0">Setting up Julia</h3>
<div class="outline-text-3" id="text-orga225ef0">
<ul class="org-ul">
<li><a href="https://julialang.org/downloads/">website</a> for downloading julia</li>
<li><a href="https://uni-koeln.sciebo.de/s/B0U2oCT7IP4YMcE">screencasts</a> on how to download and install julia</li>
</ul>
</div>
</div>
<div id="outline-container-org0b6e0b3" class="outline-3">
<h3 id="org0b6e0b3">Material</h3>
<div class="outline-text-3" id="text-org0b6e0b3">
<ul class="org-ul">
<li>julia-academy course "<a href="https://juliaacademy.com/p/julia-programming-for-nervous-beginners">Julia Programming for Nervous Beginners</a>" used in the first few weeks; you can find the course notes <a href="https://github.com/JuliaAcademy/JuliaProgrammingForNervousBeginners/tree/main/Course%20Notes">here</a>
<ul class="org-ul">
<li>pdfs for this course: <a href="./files/projectJulia/week1.pdf">week 1</a>,  <a href="./files/projectJulia/week2.pdf">week 2</a>, <a href="./files/projectJulia/week3.pdf">week 3</a>, <a href="./files/projectJulia/week4.pdf">week 4</a></li>
</ul></li>
<li><a href="https://github.com/schottmueller/juliaForMicroTheory">notebooks</a> "julia for microeconomic theory"</li>
<li><a href="https://raw.githack.com/schottmueller/projectJulia/main/exercises.html">exercises</a> to be solved in class</li>
<li><a href="https://github.com/schottmueller/projectJulia/files/11769248/projects.pdf">project description</a></li>
</ul>
</div>
</div>
<div id="outline-container-org16a5731" class="outline-3">
<h3 id="org16a5731">Beyond this course</h3>
<div class="outline-text-3" id="text-org16a5731">
<ul class="org-ul">
<li><a href="https://julia.quantecon.org/intro.html">QuantEcon</a> is a graduate course in quantitative economics using julia. The material is beyond the scope of this course but might give you an idea how the tools taught in this course are used in economic research.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3d0f8d4" class="outline-2">
<h2 id="org3d0f8d4">Selected solutions</h2>
<div class="outline-text-2" id="text-org3d0f8d4">
</div>
<div id="outline-container-org0d9ce47" class="outline-3">
<h3 id="org0d9ce47">Week 2</h3>
<div class="outline-text-3" id="text-org0d9ce47">
<ol class="org-ol">
<li><p>
Using list comprehension create an array that contains all the lower case characters of the alphabet and bind this array to the variable name <i>alphabet</i>. (<i>Hint:</i> Recall that <i>'a'+0='a'</i>, <i>'a'+1='b'</i> etc.)
</p>

<p>
Then create a single string that contains all the letters of the alphabet and bind it to the name <i>alphabetstring</i>. Also create another string variable <i>alphabetcomma</i> that contains all letters of the alphabet separated by comma.
</p>

<p>
Next create an array that contains the string "letter number 1 in the alphabet is a" as first element, the string "letter number 2 in the alphabet is b" as its second element and so on until "letter number 26 in the alphabet is z".
</p>
<div class="org-src-container">
<pre class="src src-julia">alphabet = ['a'+i for i in 0:25]
alphabetstring = join(alphabet)
alphabetstring = join(alphabet, ", ")
["letter number $(i) in the alphabet is $(alphabet[i])" for i in 1:26]
</pre>
</div></li>

<li><p>
Use the <i>string</i> function with the keyword <i>pad</i> as well as a list comprehension and the <i>join</i> function to create a string "101001000100001000001000000100000001". Can you also do it without using <i>pad</i> (and without typing it in digit by digit, of course)?
</p>
<div class="org-src-container">
<pre class="src src-julia">join([string(1;pad=i) for i in 1:7])
string(join(["1"*"0"^i for i in 1:7]),"1")
</pre>
</div></li>
</ol>
</div>
</div>
<div id="outline-container-orge86d147" class="outline-3">
<h3 id="orge86d147">Week 3</h3>
<div class="outline-text-3" id="text-orge86d147">
<ol class="org-ol">
<li><p>
Out of how many code blocks does the following code block consist and what does the function <i>move1</i> do?
</p>
<div class="org-src-container">
<pre class="src src-julia">var = "xyz"
function move1(input)
         output = string(input[2:end],input[1])
         return output
end
move1(var)
</pre>
</div>
<p>
The function moves the first letter to the end of the word.
</p></li>
<li><p>
If we add the following to the code of the previous exercise
</p>
<div class="org-src-container">
<pre class="src src-julia">function move1(input::Number)
         output = input + 1
         return output
end
</pre>
</div>
<p>
What output do you expect for the following function calls? Think first before trying!
</p>
<div class="org-src-container">
<pre class="src src-julia">move1(3)
move1(3.0)
move1("3")
move1("3.0")
move1('3')
move1([1, 2, 3])
</pre>
</div>
<p>
Adds 1 to a number. The important question is whether the input is a "number" or not. If not, the first definition of <i>move1</i> that moves the first letter to the end is used.
</p></li>
<li><p>
Write a function <i>addfractions(numerator1,denominator1,numerator2,denominator2)</i> that returns the sum of the fractions \(numerator1/denominator1\)  and \(numerator2/denominator2\) as \(numeratorSum,denominatorSum\); e.g. <i>addfractions(1,2,1,3)</i> should return \(5,6\) as \(1/2+1/3=5/6\). (Note that you do not have to cancel common multipliers in the result.)
</p>
<div class="org-src-container">
<pre class="src src-julia">function addfractions(numerator1,denominator1,numerator2,denominator2)
         denominatorSum = denominator1*denominator2
         numeratorSum = numerator1*denominator2 + numerator2*denominator1
         return numeratorSum, denominatorSum
end
</pre>
</div></li>

<li><p>
Write a function <i>evaluatef</i> that takes two inputs: (i) another function (that I call <i>f</i> in the following), (ii) a range (e.g. 1:5). The function <i>evaluatef</i> should evaluate <i>f</i> at each point of the range and print the output. For example, if \(f(x)=x^2\), then \(evaluatef(f,1:3)\) should print:
</p>
<blockquote>
<p>
f(1) equals 1
</p>

<p>
f(2) equals 4
</p>

<p>
f(3) equals 9
</p>
</blockquote>
<p>
(<i>Hint:</i> to get the text printed line by line you have to recall what we did last week, namely list comprehension and escape sequences.)
</p>
<div class="org-src-container">
<pre class="src src-julia">function evaluatef(f,range)
        println(join(["f($(i)) equals $(f(i)) \n" for i in range]))
end
</pre>
</div></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">

<hr style="clear:both;margin-top: -0cm;"/>

<div style="text-align: right;margin-top:-0.1cm">
  <a href="https://schottmueller.github.io/disclaimer.html"> <small>Disclaimer</small> </a>
</div>
</div>
</body>
</html>
